> Thanks for reaching out @jtbaker - I believe I found the root cause here.
> 
> In Prefect Cloud, to create a workspace you need both account ID and workspace ID ([API docs](https://app.prefect.cloud/api/docs#tag/Work-Pools/operation/create_work_pool_api_accounts__account_id__workspaces__workspace_id__work_pools__post)):
> 
> In your config, you've only defined account ID - which somewhat makes sense, since that's the minimal example from the docs and the work pool resource docs say Workspace ID is optional. And it _is_ optional, but that's mostly because you wouldn't have the concept of a workspace ID in the open source version of Prefect.
> 
> I think we can make this clearer in the docs, and maybe even return an error in the scenario that you are in Prefect Cloud and the specific resource requires a workspace ID to be configured. Let me chew on this and I'll follow up here with any updates.

Hey @mitchnielsen, I actually tried using the workspace id in both places in my real use case, but didn't include it in my reproducible example as it didn't seem to make a difference. With an updated

variables.tf
```tf
variable "prefect_api_key" {
  description = "Prefect Cloud API key"
  type        = string
}

variable "prefect_account_id" {
  description = "Prefect Account ID"
  type        = string
}


variable "prefect_workspace_id" {
  description = "Prefect Workspace ID"
  type        = string
}
```

and 

main.tf
```tf
terraform {
  required_providers {
    prefect = {
      source = "prefecthq/prefect"
      version = "2.3.0"
    }
  }
}

provider "prefect" {
  api_key = var.prefect_api_key
  account_id = var.prefect_account_id
  workspace_id = var.prefect_workspace_id
}


resource "prefect_work_pool" "test_work_pool" {
  name = "test-work-pool"
  type = "kubernetes"
  workspace_id = var.prefect_workspace_id
}
```

```
export TF_VAR_prefect_workspace_id=<my-workspace-id>
terraform plan
```

I get this message from `terraform plan`, confirming that the workspace id is set in the configuration:
```
  # prefect_work_pool.test_work_pool will be created
  + resource "prefect_work_pool" "test_work_pool" {
      + base_job_template = jsonencode({})
      + created           = (known after apply)
      + default_queue_id  = (known after apply)
      + id                = (known after apply)
      + name              = "test-work-pool"
      + paused            = false
      + type              = "kubernetes"
      + updated           = (known after apply)
      + workspace_id      = "<my-workspace-id>"
    }
```

but still seem the same error after `terraform apply`

```
2024-10-16T11:39:41.071-0500 [ERROR] vertex "prefect_work_pool.test_work_pool" error: Error during create Work Pool
╷
│ Error: Error during create Work Pool
│ 
│   with prefect_work_pool.test_work_pool,
│   on main.tf line 17, in resource "prefect_work_pool" "test_work_pool":
│   17: resource "prefect_work_pool" "test_work_pool" {
│ 
│ Could not create Work Pool, unexpected error: status code 404 Not Found, error=
```

Do you have a sandbox workspace you could test these terraform configs out and seeing if they reproduce for you? I've blown away all my `.terraform` directories and files and started the state fresh with `terraform init` a few times and still seeing the error.